#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	//float a;
	//printf("값을 입력하세요 : ");
	//scanf(" %f", &a);
	//if (a >5)
	//{
	//	printf("숫자가 큽니다.\n");
	//}
	//printf("값을 입력하세요 : ");
	//scanf(" %f", &a);
	//if (a <= 5)
	//{
	//	printf("숫자가 작습니다.");
	//}
	////char c = 'a';
	//if (5-5)
	//{
	//	printf("sdsd");
	//}
	//int a;
	//scanf(" %d", &a);
	//
	//if (a > 3)
	//{
	//	printf("%d는 3보다 크다.", a);
	//}
	//else
	//{
	//	printf("%d는 3보다 작다.", a);
	//}
	//------------------------------------------------------------
	//float a; 
	//printf("점수를 입력하면 합/불합 여부를 알려줍니당 : ");
	//scanf(" %f", &a);
	//if (a >= 60 && a<=100)
	//{
	//	printf("축하합니다. 합격입니다.\n");
	//}
	//else
	//{
	//	printf("불합격입니다. \n");
	//}
	//
	//float b;
	//printf("숫자를 입력하면 양수/음수를 판별해줍니당. : ");
	//scanf(" %f", &b);
	//
	//if (b >= 0)
	//{
	//	printf("입력한 수는 양수 입니다.\n");
	//}
	//else
	//{
	//	printf("입력한 수는 음수 입니다.\n");
	//}
	//--------------------------------------------------------

	//printf("연습문제 1번 \n");
	//
	//int a; 
	//printf("양의 정수를 입력하면 홀짝을 판별해줍니당 : ");
	//scanf(" %d", &a);
	//if (a % 2 == 0 && a > 0)
	//{
	//	printf("입력하신 수는 짝수입니당.\n");
	//}
	//else if(a % 2 != 0 && a > 0)
	//{
	//	printf("입력하신 수는 홀수입니당.\n");
	//}
	//else 
	//{
	//	printf("홀짝을 구분 할 수 없습니당.\n");
	//}
	//printf("\n------------------------------------------\n");
	//printf("연습문제 2번 \n");
	//int b;

	//printf("숫자를 입력하면 9의 배수인지 알려줍니당. : ");

	//scanf(" %d", &b);
	//if (b % 9 == 0)
	//{
	//	printf("입력하신 수 %d는 9의 배수가 맞습니다.\n", b);
	//}
	//else
	//{
	//	printf("입력하신 수 %d는 9의 배수가 아닙니당.\n", b);
	//}
	//printf("\n------------------------------------------\n");
	//printf("연습문제 3번 \n");

	//float c;
	//float d;
	//printf("숫자 두개를 입력하면 둘 중 큰 수를 출력해줍니당. : ");
	//scanf(" %f %f", &c, &d);
	//if (c > d)
	//{
	//	printf("%.1f가 %.1f보다 큽니다.", c, d);
	//}
	//else if (d > c)
	//{
	//	printf("%.1f가 %.1f보다 큽니다.", d, c);
	//}
	//else
	//{
	//	printf("입력하신 두 수는 같은 수 입니다.");
	//}
	//printf("\n------------------------------------------\n");
	//printf("연습문제 4번 \n");

	//float e;
	//float f;
	//printf("점수 두개를 입력해서 합계 100점 이상이면 합격, 아니면 불합격입니다.\n");
	//printf("첫번째 점수를 입력하세요. : ");
	//scanf(" %f", &e);
	//printf("두번째 점수를 입력하세요. : ");
	//scanf(" %f", &f);

	//if (e + f >= 100)
	//{
	//	printf("축하합니다. 합격입니다.");
	//}
	//else
	//{
	//	printf("불합격입니다.");
	//}
	//printf("\n------------------------------------------\n");
	//printf("연습문제 5번 \n");

	//float g;
	//float h;
	//float i;
	//float avg;
	//printf("3개 과목의 평균이 60점 이상이면 합격입니다. \n");
	//printf("첫번째 과목 점수를 입력하세요. : ");
	//scanf(" %f", &g);
	//printf("두번째 과목 점수를 입력하세요. : ");
	//scanf(" %f", &h);
	//printf("세번째 과목 점수를 입력하세요. : ");
	//scanf(" %f", &i);

	//avg = (g + h + i) / 3;
	//if (avg>=60)
	//{
	//	printf("평균 점수는 %.2f 입니다. 축하합니다. 합격입니다. ", avg);
	//}
	//else
	//{
	//	printf("평균 점수는 %.2f 입니다. 불합격입니다.", avg);
	//}

	//printf("\n------------------------------------------\n");
	//printf("연습문제 6번 \n");

	//int num;
	//int num2;
	//printf("첫번째 입력한 숫자가 두번째 입력한 숫자의 배수인지 출력합니다.\n");
	//printf("첫번째 숫자를 입력하세요. : ");
	//scanf(" %d", &num);
	//printf("두번째 숫자를 입력하세요. : ");
	//scanf(" %d", &num2);

	//if (num % num2 == 0)
	//{
	//	printf("첫번째 입력한 수 %d은 두번째 입력한 수 %d의 배수입니다.", num, num2);
	//}
	//else
	//{
	//	printf("첫번째 입력한 수 %d은 두번째 입력한 수 %d의 배수가 아닙니다.", num, num2);
	//}

	//printf("\n------------------------------------------\n");
	//printf("연습문제 7번 \n");

	//printf("입력하신 점수에 따라 등급을 매겨드립니다. \n점수를 입력하세요 : ");
	//float test;
	//scanf(" %f", &test);


	//if (test >= 90)
	//{
	//	printf("%.1f점은 A입니다. ", test);
	//}
	//else if (test >= 80)
	//{
	//	printf("%.1f점은 B입니다. ", test);
	//}
	//else if (test >= 70)
	//{
	//	printf("%.1f점은 C입니다. ", test);
	//}
	//else if (test >= 60)
	//{
	//	printf("%.1f점은 D입니다. ", test);
	//}
	//else
	//{
	//	printf("%.1f점은 F입니다. 재수강 하세요.", test);
	//}
	//printf("\n------------------------------------------\n");
	//printf("연습문제 8번 \n");

	//float one;
	//float two;
	//float three;
	//printf("숫자 세개를 입력하면 가장 큰 수를 출력합니다.\n");
	//printf("첫번째 숫자를 입력하세요. : ");
	//scanf(" %f", &one);
	//printf("두번째 숫자를 입력하세요. : ");
	//scanf(" %f", &two);
	//printf("세번째 숫자를 입력하세요. : ");
	//scanf(" %f", &three);

	//if (one > two && one > three)
	//{
	//	printf("첫째 수 %.2f이 제일 큰 수입니다.", one);
	//}
	//else if (two > one && two > three)
	//{
	//	printf("둘째 수 %.2f이 제일 큰 수입니다.", two);
	//}
	//else if (three > one && three > two)
	//{
	//	printf("셋째 수 %.2f이 제일 큰 수입니다.", three);
	//}
	//else
	//{
	//	printf(" %.2f, %.2f, %.2f 세 수가 같습니다", one, two, three);
	//}

	//printf("\n------------------------------------------\n");
	//printf("연습문제 9번 \n");

	//int nom1,nom2, nom3, nom4 ;

	//printf("숫자 4개를 입력하면 그 중 가장 작은 수를 출력합니다.\n");
	//printf("숫자 4개를 입력하세요 : ");
	//scanf(" %d %d %d %d", &nom1, &nom2, &nom3, &nom4);
	//
	//if (nom1 < nom2 && nom1 < nom3 && nom1 < nom4)
	//{
	//	printf("%d이 가장 작습니다.", nom1);
	//}
	//else if (nom2 < nom1 && nom2 < nom3 && nom2 < nom4)
	//{
	//	printf("%d이 가장 작습니다.", nom2);
	//}
	//else if (nom3 < nom2 && nom3 < nom1 && nom3 < nom4)
	//{
	//	printf("%d이 가장 작습니다.", nom3);
	//}
	//else if (nom4 < nom2 && nom4 < nom3 && nom4 < nom1)
	//{
	//	printf("%d이 가장 작습니다.", nom4);
	//}
	//else
	//{
	//	printf("%d, %d, %d, %d 네개의 수가 같습니다.", nom1, nom2, nom3, nom4);
	//}

	//printf("\n------------------------------------------\n");
	//printf("연습문제 10번 \n");
	//
	//int n1, n2, n3, n4, n5;

	//printf(" 숫자 5개를 입력하면 가장 큰 수와 작은 수를 출력합니다.");
	//scanf(" %d %d %d %d %d", &n1, &n2, &n3, &n4, &n5);
	////-------------------이하 최댓값---------------------
	//if (n1 > n2 && n1 > n3 && n1 > n4 && n1 > n5)
	//{
	//	printf(" 가장 큰 수는 %d 입니다.", n1);
	//}
	//else if (n2 > n1 && n2 > n3 && n2 > n4 && n2 > n5)
	//{
	//	printf(" 가장 큰 수는 %d 입니다.", n2);
	//}
	//else if (n3 > n2 && n3 > n1 && n3 > n4 && n3 > n5)
	//{
	//	printf(" 가장 큰 수는 %d 입니다.", n3);
	//}
	//else if (n4 > n2 && n4 > n3 && n4 > n1 && n4 > n5)
	//{
	//	printf(" 가장 큰 수는 %d 입니다.", n4);
	//}
	//else if (n5 > n2 && n5 > n3 && n5 > n4 && n5 > n1)
	//{
	//	printf(" 가장 큰 수는 %d 입니다.", n5);
	//}
	//else
	//{
	//	printf("다섯개의 수가 같습니다.");
	//}
	////-------------------이하 최소값---------------------
	//if (n1 < n2 && n1 < n3 && n1 < n4 && n1 < n5)
	//{
	//	printf(" 가장 작은 수는 %d 입니다.", n1);
	//}
	//else if (n2 < n1 && n2 < n3 && n2 < n4 && n2 < n5)
	//{
	//	printf(" 가장 작은 수는 %d 입니다.", n2);
	//}
	//else if (n3 < n2 && n3 < n1 && n3 < n4 && n3 < n5)
	//{
	//	printf(" 가장 작은 수는 %d 입니다.", n3);
	//}
	//else if (n4 < n2 && n4 < n3 && n4 < n1 && n4 < n5)
	//{
	//	printf(" 가장 작은 수는 %d 입니다.", n4);
	//}
	//else if (n5 < n2 && n5 < n3 && n5 < n4 && n5 < n1)
	//{
	//	printf(" 가장 작은 수는 %d 입니다.", n5);
	//}
	//else
	//{
	//	printf("다섯개의 수가 같습니다.");
	//}
	//scanf(" %d %d %d", &n1, &n2, &n3);
	//int max;
	//if (n1 > n2)
	//{
	//
	//	max = n1;
	//}
	//else
	//{
	//	max = n2;
	//}
	//if (max < n3)
	//{
	//	max = n3;
	//}
	//else
	//{
	//
	//}
	//printf(" %d이 가장 큽니당", max);

	//------------------------------------------------------------------------
//
//int i; 
//printf("점수를 입력하세요\n");
//scanf(" %d", &i);
//if (i >= 0 && i <= 100)
//{
//	switch (i / 10) {
//	case 10:
//
//		printf("축하합니다. %d 점은 A+입니다.", i);
//		break;
//	case 9:
//		printf("%d점은 A입니다.", i);
//		break;
//	case 8:
//		printf("%d점은 B입니다.", i);
//		break;
//	case 7:
//	{
//		printf("%d점은 C입니다.", i);
//		break;
//	}		
//	case 6:
//		printf("%d점은 D입니다.", i);
//		break;
//	default:
//		printf("%d점은 F입니다. 재수강하세요.", i);
//		break;
//	}
//}
//else
//{
//	printf("잘못된 값을 입력했습니다.");
//}
//-----------------------------------------------

int a;
int b;
int sum;
int d;
int num;
int num2;
printf("원하는 문제 번호를 입력하세요 1~4 : ");
scanf(" %d", &a);
if (a == 1) {

	printf("\n숫자를 입력하면 양의정수로 출력해준당 : ");
	scanf(" %d", &a);
	if (a >= 0)
	{
		printf("%d", a);
	}
	else
	{
		printf("%d", a * -1);
	}
	printf("\n---------------------------------");
}
//-----------------------------------------------
if (a == 2) {
	printf("\n숫자를 두개 입력하면 큰수에서 작은수를 빼준당. : ");
	scanf(" %d %d", &a, &b);
	sum = a - b;
	if (a - b < 0)
	{
		printf("%d", sum * -1);
	}
	else
	{
		printf("%d", sum);
	}
	printf("\n---------------------------------");
}
//----------------------------------------------
if (a == 3) {
	printf("\n먼저 입력한 정수를 나중에 입력한 정수로 나눠서 몫이랑 나머지 출력해준당. : ");
	scanf(" %d %d", &a, &b);
	sum = a / b;
	d = a % b;
	if (b == 0)
	{
		printf("0으로 나눌 수 없습니다.");
	}
	else
	{
		printf("몫 : %d, 나머지 : %d", sum, d);
	}
	printf("\n---------------------------------");
}
//------------------------------------------------
if (a == 4) {
	printf("\n10~99사이의 정수를 입력하세용. 복권 당첨 여부를 알려드림니당. : ");
	scanf(" %d", &a);
	num = a / 10; //10의 자리수
	num2 = a % 10;  //1의 자리수
	if (a==77)
	{
		printf("축하합니다. 1등 당첨입니다.");
	}
	else if (num == 7)
	{
		printf("축하합니다. 2등 당첨입니다.");
	}
	else if (num2 == 7)
	{
		printf("축하합니다. 3등 당첨입니다.");
	}
	else
	{
		printf("아쉽습니다. 꽝입니다.");
	}
	printf("\n---------------------------------");
}

//---------------------------------------------------





}